In [1]:
import pandas as pd

In [10]:
data = {
    '이름' : ['김자바', '이자바', '박자바', '김캐드', '정캐드'],
    '학교' : ['자바학교', '자바학교', '자바학교', '캐드학교', '캐드학교'],
    '국어점수 ' : [70, 80, 90, 60,80],
    '수학점수' : [90, 80, 100, 70 , 80],
    '평균' : [80.0, 80.0, 95.0, 65.0, 80.0],
    '취미 ' : ['운동', '독서', '등산', '', '']
}

In [11]:
df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번'])

In [12]:
df

     이름    학교  국어점수   수학점수    평균 취미
1번  김자바  자바학교     70    90  80.0  운동
2번  이자바  자바학교     80    80  80.0  독서
3번  박자바  자바학교     90   100  95.0  등산
4번  김캐드  캐드학교     60    70  65.0
5번  정캐드  캐드학교     80    80  80.0

In [13]:
df.index.name = '학번'

In [14]:
df.to_excel('student.xlsx')

In [15]:
df = pd.read_excel('student.xlsx')

In [19]:
df.set_index('학번', inplace=True)
df

     이름    학교  국어점수   수학점수  평균  취미
학번
1번  김자바  자바학교     70    90  80   운동
2번  이자바  자바학교     80    80  80   독서
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

In [20]:
df.describe()

           국어점수         수학점수         평균
count   5.000000    5.000000   5.000000
mean   76.000000   84.000000  80.000000
std    11.401754   11.401754  10.606602
min    60.000000   70.000000  65.000000
25%    70.000000   80.000000  80.000000
50%    80.000000   80.000000  80.000000
75%    80.000000   90.000000  80.000000
max    90.000000  100.000000  95.000000

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1번 to 5번
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      5 non-null      object
 1   학교      5 non-null      object
 2   국어점수    5 non-null      int64
 3   수학점수    5 non-null      int64
 4   평균      5 non-null      int64
 5   취미      3 non-null      object
dtypes: int64(3), object(3)
memory usage: 280.0+ bytes

In [22]:
df.head() #처음 5개의 row를 가져 옴
df.head(3) #처음 3개의 데이터를 가져옴

     이름    학교  국어점수   수학점수  평균  취미
학번
1번  김자바  자바학교     70    90  80   운동
2번  이자바  자바학교     80    80  80   독서
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

In [24]:
df.tail() # 마지막 5개의 row를 가져 옴
df.tail(3) # 마지막 3개의 row를 가져 옴

     이름    학교  국어점수   수학점수  평균  취미
학번
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

In [26]:
df.values

array([['김자바', '자바학교', 70, 90, 80, '운동'],
       ['이자바', '자바학교', 80, 80, 80, '독서'],
       ['박자바', '자바학교', 90, 100, 95, '등산'],
       ['김캐드', '캐드학교', 60, 70, 65, nan],
       ['정캐드', '캐드학교', 80, 80, 80, nan]], dtype=object)

In [27]:
df.index

Index(['1번', '2번', '3번', '4번', '5번'], dtype='object', name='학번')

In [28]:
df.columns

Index(['이름', '학교', '국어점수 ', '수학점수', '평균', '취미 '], dtype='object')

In [30]:
df.shape #데이터의 행과 열의 개수를 확인

(5, 6)

###  Series 확인

In [32]:
df['이름']

학번
1번    김자바
2번    이자바
3번    박자바
4번    김캐드
5번    정캐드
Name: 이름, dtype: object

In [33]:
df['이름'].describe

<bound method NDFrame.describe of 학번
1번    김자바
2번    이자바
3번    박자바
4번    김캐드
5번    정캐드
Name: 이름, dtype: object>

In [42]:
df['수학점수'].min()
df['수학점수'].max()
df['수학점수'].nlargest(3) #점수가 큰 순서대로 3개의 데이터를 가져 옴
df['수학점수'].mean() #평균
df['수학점수'].sum()
df['수학점수'].count() #NaN 데이터는 제외

5

In [46]:
df['학교'].unique()  #중복제거
df['학교'].nunique() # 중복제거한 데이터의 개수

2